VPro/src/Documents/LoanInterestCommissionAccruals/LoanInterestCommissionAccruals.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>LoanInterestCommissionAccruals</name>
  <registerRecords>AccountingRegister.Managerial</registerRecords>
  <registerRecords>AccumulationRegister.Inventory</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.LoanSettlements</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>OperationType</name>
    <type>
      <types>EnumRef.LoanAccrualTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>StartDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Accruals</name>
    <attributes>
      <name>AmountType</name>
      <type>
        <types>EnumRef.LoanScheduleAmountTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Lender</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>LoanContract</name>
      <type>
        <types>DocumentRef.LoanContract</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsCurrency</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

VPro/src/InformationRegisters/CurrencyRates/CurrencyRates.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CurrencyRates</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Multiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/Enums/LoanAccrualTypes/LoanAccrualTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanAccrualTypes</name>
  <enumValues>
    <name>AccrualsForEmployeeLoans</name>
  </enumValues>
  <enumValues>
    <name>AccrualsForLoansBorrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/LoanContractTypes/LoanContractTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanContractTypes</name>
  <enumValues>
    <name>EmployeeLoanAgreement</name>
  </enumValues>
  <enumValues>
    <name>Borrowed</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/LoanScheduleAmountTypes/LoanScheduleAmountTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>LoanScheduleAmountTypes</name>
  <enumValues>
    <name>Principal</name>
  </enumValues>
  <enumValues>
    <name>Interest</name>
  </enumValues>
  <enumValues>
    <name>Commission</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Enums/GLAccountsTypes/GLAccountsTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>GLAccountsTypes</name>
  <enumValues>
    <name>DepreciationFixedAssets</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>FixedAssets</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>AccountsGroup</name>
    <comment>Service</comment>
  </enumValues>
  <enumValues>
    <name>Debitors</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>CashAssets</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>LongtermObligations</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Incomings</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Inventory</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Capital</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>IndirectExpenses</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>ShorttermInvestments</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Creditors</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>Loans</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>ProfitTax</name>
  </enumValues>
  <enumValues>
    <name>UnfinishedProduction</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>UndistributedProfit</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ProfitLosses</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>LoanInterest</name>
  </enumValues>
  <enumValues>
    <name>OtherFixedAssets</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>OtherIncome</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>OtherShorttermObligations</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>OtherCurrentAssets</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>OtherExpenses</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Expenses</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>ReserveAndAdditionalCapital</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>CostOfGoodsSold</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>TradeMarkup</name>
  </enumValues>
</mdclass:Enum>

VPro/src/Catalogs/StructuralUnits/StructuralUnits.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>StructuralUnits</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>MainDepartment</name>
      <description>Bộ phận chính</description>
    </items>
    <items>
      <name>MainWarehouse</name>
      <description>Kho chính</description>
    </items>
  </predefined>
  <attributes>
    <name>StructuralUnitType</name>
    <type>
      <types>EnumRef.StructuralUnitsTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderWarehouse</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>FRP</name>
    <type>
      <types>CatalogRef.Individuals</types>
    </type>
  </attributes>
  <attributes>
    <name>RetailPriceKind</name>
    <type>
      <types>CatalogRef.PriceKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>GLAccountInRetail</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>MarkupGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.Managerial</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>TransferRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>DisposalsRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>WriteOffToExpensesRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>PassToOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSource</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationSourceCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipient</name>
    <type>
      <types>CatalogRef.StructuralUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>ReturnFromOperationRecipientCell</name>
    <type>
      <types>CatalogRef.Cells</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInformation</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ContactInformation</name>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.ContactInformationTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Kind</name>
      <type>
        <types>CatalogRef.ContactInformationKinds</types>
      </type>
    </attributes>
    <attributes>
      <name>Presentation</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>FieldValues</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Country</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Region</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>City</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>EmailAddress</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ServerDomainName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PhoneNumberWithoutCodes</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

VPro/src/Documents/LoanInterestCommissionAccruals/ManagerModule.bsl
#If Server OR ThickClientOrdinaryApplication OR ExternalConnection Then

// Generates the value table containing data to post for the register.
// Saves value tables to properties of the "AdditionalProperties" structure.
//
Procedure GenerateTableLoanSettlements(DocumentRefAccrualsForLoans, StructureAdditionalProperties)
	
	Query = New Query;
	Query.TempTablesManager = StructureAdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager;
	
	Query.SetParameter("Company",					StructureAdditionalProperties.ForPosting.Company);
	Query.SetParameter("CreditInterestAccrued",		NStr("en='(Received) loan interest is accrued';ru='Начислены проценты по кредиту (полученному)';vi='Đã tính lãi theo khoản cho khoản vay (đã nhận)'"));
	Query.SetParameter("CreditCommissionAccrued",	NStr("en='(Received) loan commission is accrued';ru='Начислена комиссия по кредиту (полученному)';vi='Đã tính phí ngân hàng theo khoản vay (đã nhận)'"));
	Query.SetParameter("LoanInterestAccrued",		NStr("en='(Issued) loan interest is accrued';ru='Начислены проценты по займу (выданному)';vi='Đã tính lãi theo khoản nợ (đã cấp)'"));
	Query.SetParameter("LoanCommissionAccrued",		NStr("en='(Issued) loan commission is accrued';ru='Начислена комиссия по займу (выданному)';vi='Đã tính phí ngân hàng theo khoản nợ (đã cấp)'"));
	Query.SetParameter("Ref",						DocumentRefAccrualsForLoans);
	Query.SetParameter("PointInTime",				New Boundary(StructureAdditionalProperties.ForPosting.PointInTime, 
		BoundaryType.Including));	
	Query.SetParameter("AccountingCurrency",		Constants.AccountingCurrency.Get());
	
	Query.Text =
	"SELECT
	|	&Company AS Company,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.Ref.OperationType = VALUE(Enum.LoanAccrualTypes.AccrualsForLoansBorrowed)
	|			THEN VALUE(AccumulationRecordType.Expense)
	|		ELSE VALUE(AccumulationRecordType.Receipt)
	|	END AS RecordType,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.Ref.OperationType = VALUE(Enum.LoanAccrualTypes.AccrualsForLoansBorrowed)
	|			THEN AccrualsForLoansAccruals.Lender
	|		ELSE AccrualsForLoansAccruals.Employee
	|	END AS Counterparty,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.Ref.OperationType = VALUE(Enum.LoanAccrualTypes.AccrualsForLoansBorrowed)
	|			THEN VALUE(Enum.LoanContractTypes.Borrowed)
	|		ELSE VALUE(Enum.LoanContractTypes.EmployeeLoanAgreement)
	|	END AS LoanKind,
	|	AccrualsForLoansAccruals.LoanContract AS LoanContract,
	|	AccrualsForLoansAccruals.Date AS Period,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Interest)
	|			THEN AccrualsForLoansAccruals.Total
	|		ELSE 0
	|	END AS InterestCur,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Commission)
	|			THEN AccrualsForLoansAccruals.Total
	|		ELSE 0
	|	END AS CommissionCur,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Interest)
	|			THEN CAST(AccrualsForLoansAccruals.Total * AccountingExchangeRates.Multiplicity * SettlementExchangeRates.ExchangeRate / (AccountingExchangeRates.ExchangeRate * SettlementExchangeRates.Multiplicity) AS NUMBER(15, 2))
	|		ELSE 0
	|	END AS Interest,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Commission)
	|			THEN CAST(AccrualsForLoansAccruals.Total * AccountingExchangeRates.Multiplicity * SettlementExchangeRates.ExchangeRate / (AccountingExchangeRates.ExchangeRate * SettlementExchangeRates.Multiplicity) AS NUMBER(15, 2))
	|		ELSE 0
	|	END AS Commission,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.Ref.OperationType = VALUE(Enum.LoanAccrualTypes.AccrualsForLoansBorrowed)
	|			THEN CASE
	|					WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Commission)
	|						THEN &CreditCommissionAccrued
	|					ELSE &CreditInterestAccrued
	|				END
	|		ELSE CASE
	|				WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Commission)
	|					THEN &LoanCommissionAccrued
	|				ELSE &LoanInterestAccrued
	|			END
	|	END AS ContentOfAccountingRecord
	|FROM
	|	Document.LoanInterestCommissionAccruals.Accruals AS AccrualsForLoansAccruals
	|		LEFT JOIN InformationRegister.CurrencyRates.SliceLast(&PointInTime, ) AS SettlementExchangeRates
	|		ON AccrualsForLoansAccruals.SettlementsCurrency = SettlementExchangeRates.Currency
	|		LEFT JOIN InformationRegister.CurrencyRates.SliceLast(&PointInTime, Currency = &AccountingCurrency) AS AccountingExchangeRates
	|		ON (AccountingExchangeRates.Currency = &AccountingCurrency)
	|WHERE
	|	AccrualsForLoansAccruals.Ref = &Ref";
	
	RequestResult = Query.Execute();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableLoanSettlements", RequestResult.Unload());
	
EndProcedure // GenerateTableSettlementsWithCustomers()

// Initializes value tables containing data of the document tabular sections.
// Saves value tables to properties of the "AdditionalProperties" structure.
//
Procedure InitializeDocumentData(DocumentRefAccrualsForLoans, StructureAdditionalProperties) Export

	Query = New Query(
	"SELECT
	|	AccrualsForLoansAccruals.Ref,
	|	AccrualsForLoansAccruals.LineNumber,
	|	AccrualsForLoansAccruals.AmountType,
	|	AccrualsForLoansAccruals.Date,
	|	AccrualsForLoansAccruals.Employee,
	|	AccrualsForLoansAccruals.Lender,
	|	AccrualsForLoansAccruals.LoanContract,
	|	AccrualsForLoansAccruals.SettlementsCurrency,
	|	AccrualsForLoansAccruals.Total AS AmountCur,
	|	CAST(AccrualsForLoansAccruals.Total * AccountingExchangeRates.Multiplicity * SettlementExchangeRates.ExchangeRate / (AccountingExchangeRates.ExchangeRate * SettlementExchangeRates.Multiplicity) AS NUMBER(15, 2)) AS Amount,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.Ref.OperationType = &AccrualsForLoans
	|			THEN AccrualsForLoansAccruals.LoanContract.CostAccount
	|		ELSE CASE
	|				WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Interest)
	|					THEN AccrualsForLoansAccruals.LoanContract.InterestGLAccount
	|				ELSE AccrualsForLoansAccruals.LoanContract.CommissionGLAccount
	|			END
	|	END AS CostAccount,
	|	AccrualsForLoansAccruals.LoanContract.CostAccount AS GLAccountOfIncomeAndExpenses,
	|	AccrualsForLoansAccruals.LoanContract.StructuralUnit AS StructuralUnit,
	|	AccrualsForLoansAccruals.LoanContract.Order AS CustomerOrder,
	|	CASE
	|		WHEN AccrualsForLoansAccruals.Ref.OperationType = &AccrualsForLoans
	|			THEN CASE
	|					WHEN AccrualsForLoansAccruals.AmountType = VALUE(Enum.LoanScheduleAmountTypes.Interest)
	|						THEN AccrualsForLoansAccruals.LoanContract.InterestGLAccount
	|					ELSE AccrualsForLoansAccruals.LoanContract.CommissionGLAccount
	|				END
	|		ELSE AccrualsForLoansAccruals.LoanContract.CostAccount
	|	END AS Correspondence
	|INTO Accruals
	|FROM
	|	Document.LoanInterestCommissionAccruals.Accruals AS AccrualsForLoansAccruals
	|		LEFT JOIN InformationRegister.CurrencyRates.SliceLast(&PointInTime, ) AS SettlementExchangeRates
	|		ON AccrualsForLoansAccruals.SettlementsCurrency = SettlementExchangeRates.Currency
	|		LEFT JOIN InformationRegister.CurrencyRates.SliceLast(&PointInTime, Currency = &AccountingCurrency) AS AccountingExchangeRates
	|		ON (AccountingExchangeRates.Currency = &AccountingCurrency)
	|WHERE
	|	AccrualsForLoansAccruals.Ref = &Ref
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Accruals.LineNumber AS LineNumber,
	|	Accruals.Ref.Date AS Period,
	|	&Company AS Company,
	|	CASE
	|		WHEN Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				OR Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.LoanInterest)
	|			THEN VALUE(Catalog.BusinessActivities.Other)
	|		ELSE Accruals.LoanContract.BusinessArea
	|	END AS BusinessArea,
	|	CASE
	|		WHEN Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				OR Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.LoanInterest)
	|			THEN VALUE(Catalog.StructuralUnits.EmptyRef)
	|		ELSE Accruals.StructuralUnit
	|	END AS StructuralUnit,
	|	Accruals.GLAccountOfIncomeAndExpenses AS GLAccount,
	|	CASE
	|		WHEN Accruals.Ref.OperationType = VALUE(Enum.LoanAccrualTypes.AccrualsForEmployeeLoans)
	|			THEN Accruals.Employee
	|		ELSE Accruals.Lender
	|	END AS Dimension,
	|	CASE
	|		WHEN Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				OR Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.LoanInterest)
	|			THEN UNDEFINED
	|		ELSE Accruals.CustomerOrder
	|	END AS CustomerOrder,
	|	0 AS AmountIncome,
	|	Accruals.Amount AS AmountExpense,
	|	Accruals.Amount AS Amount,
	|	&OtherIncomeAndExpensePostingContent AS ContentOfAccountingRecord
	|FROM
	|	Accruals AS Accruals
	|WHERE
	|	Accruals.Ref.OperationType = &AccrualsForLoans
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Accruals.LineNumber AS LineNumber,
	|	Accruals.Ref.Date AS Period,
	|	&Company AS Company,
	|	CASE
	|		WHEN Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				OR Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.LoanInterest)
	|			THEN VALUE(Catalog.BusinessActivities.Other)
	|		ELSE Accruals.LoanContract.BusinessArea
	|	END AS BusinessArea,
	|	CASE
	|		WHEN Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				OR Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.LoanInterest)
	|			THEN VALUE(Catalog.StructuralUnits.EmptyRef)
	|		ELSE Accruals.StructuralUnit
	|	END AS StructuralUnit,
	|	Accruals.GLAccountOfIncomeAndExpenses AS GLAccount,
	|	CASE
	|		WHEN Accruals.Ref.OperationType = VALUE(Enum.LoanAccrualTypes.AccrualsForEmployeeLoans)
	|			THEN Accruals.Employee
	|		ELSE Accruals.Lender
	|	END AS Dimension,
	|	CASE
	|		WHEN Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.OtherExpenses)
	|				OR Accruals.CostAccount.TypeOfAccount = VALUE(Enum.GLAccountsTypes.LoanInterest)
	|			THEN UNDEFINED
	|		ELSE Accruals.CustomerOrder
	|	END AS CustomerOrder,
	|	Accruals.Amount AS AmountIncome,
	|	0 AS AmountExpense,
	|	Accruals.Amount,
	|	&OtherIncomeAndExpensePostingContent AS ContentOfAccountingRecord
	|FROM
	|	Accruals AS Accruals
	|WHERE
	|	Accruals.Ref.OperationType <> &AccrualsForLoans
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	Accruals.LineNumber AS LineNumber,
	|	Accruals.Date AS Period,
	|	&Company AS Company,
	|	VALUE(Catalog.PlanningPeriods.Actual) AS PlanningPeriod,
	|	Accruals.CostAccount AS AccountDr,
	|	CASE
	|		WHEN Accruals.CostAccount.Currency
	|			THEN Accruals.SettlementsCurrency
	|		ELSE UNDEFINED
	|	END AS CurrencyDr,
	|	CASE
	|		WHEN Accruals.CostAccount.Currency
	|			THEN Accruals.AmountCur
	|		ELSE 0
	|	END AS AmountCurDr,
	|	Accruals.Correspondence AS AccountCr,
	|	CASE
	|		WHEN Accruals.Correspondence.Currency
	|			THEN Accruals.SettlementsCurrency
	|		ELSE UNDEFINED
	|	END AS CurrencyCr,
	|	CASE
	|		WHEN Accruals.Correspondence.Currency
	|			THEN Accruals.AmountCur
	|		ELSE 0
	|	END AS AmountCurCr,
	|	Accruals.Amount,
	|	&OtherIncomeAndExpensePostingContent AS Content
	|FROM
	|	Accruals AS Accruals
	|WHERE
	|	Accruals.Ref.OperationType = &AccrualsForLoans
	|
	|UNION ALL
	|
	|SELECT
	|	Accruals.LineNumber,
	|	Accruals.Date,
	|	&Company,
	|	VALUE(Catalog.PlanningPeriods.Actual),
	|	Accruals.CostAccount,
	|	CASE
	|		WHEN Accruals.CostAccount.Currency
	|			THEN Accruals.SettlementsCurrency
	|		ELSE UNDEFINED
	|	END,
	|	CASE
	|		WHEN Accruals.CostAccount.Currency
	|			THEN Accruals.AmountCur
	|		ELSE 0
	|	END,
	|	Accruals.Correspondence,
	|	CASE
	|		WHEN Accruals.Correspondence.Currency
	|			THEN Accruals.SettlementsCurrency
	|		ELSE UNDEFINED
	|	END,
	|	CASE
	|		WHEN Accruals.Correspondence.Currency
	|			THEN Accruals.AmountCur
	|		ELSE 0
	|	END,
	|	Accruals.Amount,
	|	&OtherIncomeAndExpensePostingContent
	|FROM
	|	Accruals AS Accruals
	|WHERE
	|	Accruals.Ref.OperationType <> &AccrualsForLoans");
	
	Query.SetParameter("Ref",					DocumentRefAccrualsForLoans);
	Query.SetParameter("Company",				StructureAdditionalProperties.ForPosting.Company);
	Query.SetParameter("AccountingCurrency",	Constants.AccountingCurrency.Get());
	Query.SetParameter("PointInTime",			New Boundary(StructureAdditionalProperties.ForPosting.PointInTime, BoundaryType.Including));
	Query.SetParameter("AccrualsForLoans",	Enums.LoanAccrualTypes.AccrualsForLoansBorrowed);
	
	Query.SetParameter("OtherIncomeAndExpensePostingContent", NStr("en='Loans settlements';ru='Расчеты по кредитам и займам';vi='Hạch toán vay và nợ'"));
	
	ResultArray = Query.ExecuteBatch();
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableIncomeAndExpenses", ResultArray[1].Unload());
	
	If StructureAdditionalProperties.TableForRegisterRecords.TableIncomeAndExpenses.Count() = 0 Then
		StructureAdditionalProperties.TableForRegisterRecords.Insert("TableIncomeAndExpenses", ResultArray[2].Unload());
	Else
		
		Selection = ResultArray[2].Select();
		While Selection.Next() Do
			
			NewRow = StructureAdditionalProperties.TableForRegisterRecords.TableIncomeAndExpenses.Add();
			FillPropertyValues(NewRow, Selection);
			
		EndDo;
		
	EndIf;
	
	StructureAdditionalProperties.TableForRegisterRecords.Insert("TableManagerial", ResultArray[3].Unload());
	
	// LoanSettlements
	GenerateTableLoanSettlements(DocumentRefAccrualsForLoans, StructureAdditionalProperties);
	
EndProcedure // InitializeDocumentData()

#Region PrintInterface

// Fills the list of printing commands.
// 
// Parameters:
//   PrintCommands - ValueTable - see field content in the PrintManagement.CreatePrintCommandCollection function.
//
Procedure AddPrintCommands(PrintCommands) Export
		
EndProcedure

#EndRegion

#EndIf
